eisup_2019_docmng_integration/src/Documents/zsttk_РаспределениеЗаказовПоМенеджерам/zsttk_РаспределениеЗаказовПоМенеджерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>zsttk_РаспределениеЗаказовПоМенеджерам</name>
  <comment>Распределение заказов по менеджерам</comment>
  <registerRecords>InformationRegister.zsttk_МенеджерыПоЗаказам</registerRecords>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентМенеджерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/zsttk_МенеджерыПоЗаказам/zsttk_МенеджерыПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>zsttk_МенеджерыПоЗаказам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентМенеджерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/zsttk_РаспределениеЗаказовПоМенеджерам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	итогоПроцент = 0;
	Для Каждого ТекСтрокаМенеджеры Из Менеджеры Цикл
		// регистр zsttk_МенеджерыПоЗаказам 
		итогоПроцент = итогоПроцент +  ТекСтрокаМенеджеры.Процент;
	КонецЦикла;
	
	Если итогоПроцент > 100 Тогда
		сообщить("Сумма % всех менеджеров, не может превышать 100%");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	Движение = Движения.zsttk_МенеджерыПоЗаказам.Добавить();
	Движение.Период = Дата;
	Движение.ЗаказПокупателя = ЗаказПокупателя;
	Движение.ПроцентМенеджерам = ПроцентМенеджерам;
		
		
	//Для Каждого ТекСтрокаМенеджеры Из Менеджеры Цикл
	//	// регистр zsttk_МенеджерыПоЗаказам 
	//	Движение = Движения.zsttk_МенеджерыПоЗаказам.Добавить();
	//	Движение.Период = Дата;
	//	Движение.ЗаказПокупателя = ЗаказПокупателя;
	//	Движение.ПроцентМенеджерам = ПроцентМенеджерам;
	//	//Движение.РаспределениеПоМенеджерам = ЭтотОбъект;
	//	
	//	
	//	//Движение.Менеджер = ТекСтрокаМенеджеры.Менеджер;
	//	//Движение.Процент = ТекСтрокаМенеджеры.Процент;
	//КонецЦикла;
	// записываем движения регистров
	Движения.zsttk_МенеджерыПоЗаказам.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
